GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k50.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON1), 0, a
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDOVF                           BANKMASK(BAUDCON1), 7, a
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ACKDT                            BANKMASK(SSP1CON2), 5, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKEN                            BANKMASK(SSP1CON2), 4, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKSTAT                          BANKMASK(SSP1CON2), 6, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKTIM                           BANKMASK(SSP1CON3), 7, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define ACTD                             BANKMASK(ACTCON), 6, a
#define ACTEN                            BANKMASK(ACTCON), 7, a
#define ACTIE                            BANKMASK(PIE1), 7, a
#define ACTIF                            BANKMASK(PIR1), 7, a
#define ACTIP                            BANKMASK(IPR1), 7, a
#define ACTLOCK                          BANKMASK(ACTCON), 3, a
#define ACTMD                            BANKMASK(PMD0), 4, a
#define ACTOR                            BANKMASK(ACTCON), 1, a
#define ACTORS                           BANKMASK(ACTCON), 1, a
#define ACTSEL                           BANKMASK(ACTCON), 7, a
#define ACTSRC                           BANKMASK(ACTCON), 4, a
#define ACTUD                            BANKMASK(ACTCON), 6, a
#define ACTVIE                           BANKMASK(UIE), 2, a
#define ACTVIF                           BANKMASK(UIR), 2, a
#define ADCMD                            BANKMASK(PMD1), 2, a
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN                            BANKMASK(RCSTA1), 3, a
#define ADDR0                            BANKMASK(UADDR), 0, a
#define ADDR1                            BANKMASK(UADDR), 1, a
#define ADDR2                            BANKMASK(UADDR), 2, a
#define ADDR3                            BANKMASK(UADDR), 3, a
#define ADDR4                            BANKMASK(UADDR), 4, a
#define ADDR5                            BANKMASK(UADDR), 5, a
#define ADDR6                            BANKMASK(UADDR), 6, a
#define ADEN                             BANKMASK(RCSTA1), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK1                           BANKMASK(SSP1CON2), 1, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK2                           BANKMASK(SSP1CON2), 2, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK3                           BANKMASK(SSP1CON2), 3, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK4                           BANKMASK(SSP1CON2), 4, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK5                           BANKMASK(SSP1CON2), 5, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define AHEN                             BANKMASK(SSP1CON3), 1, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define ANSA0                            BANKMASK(ANSELA), 0, b
#define ANSA1                            BANKMASK(ANSELA), 1, b
#define ANSA2                            BANKMASK(ANSELA), 2, b
#define ANSA3                            BANKMASK(ANSELA), 3, b
#define ANSA5                            BANKMASK(ANSELA), 5, b
#define ANSB0                            BANKMASK(ANSELB), 0, b
#define ANSB1                            BANKMASK(ANSELB), 1, b
#define ANSB2                            BANKMASK(ANSELB), 2, b
#define ANSB3                            BANKMASK(ANSELB), 3, b
#define ANSB4                            BANKMASK(ANSELB), 4, b
#define ANSB5                            BANKMASK(ANSELB), 5, b
#define ANSC2                            BANKMASK(ANSELC), 2, b
#define ANSC6                            BANKMASK(ANSELC), 6, b
#define ANSC7                            BANKMASK(ANSELC), 7, b
#define ANSD0                            BANKMASK(ANSELD), 0, b
#define ANSD1                            BANKMASK(ANSELD), 1, b
#define ANSD2                            BANKMASK(ANSELD), 2, b
#define ANSD3                            BANKMASK(ANSELD), 3, b
#define ANSD4                            BANKMASK(ANSELD), 4, b
#define ANSD5                            BANKMASK(ANSELD), 5, b
#define ANSD6                            BANKMASK(ANSELD), 6, b
#define ANSD7                            BANKMASK(ANSELD), 7, b
#define ANSE0                            BANKMASK(ANSELE), 0, b
#define ANSE1                            BANKMASK(ANSELE), 1, b
#define ANSE2                            BANKMASK(ANSELE), 2, b
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSP1STAT), 0, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOEN                             BANKMASK(SSP1CON3), 4, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG0                             BANKMASK(SPBRG1), 0, a
#define BRG1                             BANKMASK(SPBRG1), 1, a
#define BRG10                            BANKMASK(SPBRGH1), 2, a
#define BRG11                            BANKMASK(SPBRGH1), 3, a
#define BRG12                            BANKMASK(SPBRGH1), 4, a
#define BRG13                            BANKMASK(SPBRGH1), 5, a
#define BRG14                            BANKMASK(SPBRGH1), 6, a
#define BRG15                            BANKMASK(SPBRGH1), 7, a
#define BRG16                            BANKMASK(BAUDCON1), 3, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG2                             BANKMASK(SPBRG1), 2, a
#define BRG3                             BANKMASK(SPBRG1), 3, a
#define BRG4                             BANKMASK(SPBRG1), 4, a
#define BRG5                             BANKMASK(SPBRG1), 5, a
#define BRG6                             BANKMASK(SPBRG1), 6, a
#define BRG7                             BANKMASK(SPBRG1), 7, a
#define BRG8                             BANKMASK(SPBRGH1), 0, a
#define BRG9                             BANKMASK(SPBRGH1), 1, a
#define BRGH                             BANKMASK(TXSTA1), 2, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BTOEE                            BANKMASK(UEIE), 4, a
#define BTOEF                            BANKMASK(UEIR), 4, a
#define BTSEE                            BANKMASK(UEIE), 7, a
#define BTSEF                            BANKMASK(UEIR), 7, a
#define C1CH0                            BANKMASK(CM1CON0), 0, a
#define C1CH1                            BANKMASK(CM1CON0), 1, a
#define C1HYS                            BANKMASK(CM2CON1), 3, a
#define C1IE                             BANKMASK(PIE2), 6, a
#define C1IF                             BANKMASK(PIR2), 6, a
#define C1IP                             BANKMASK(IPR2), 6, a
#define C1OE                             BANKMASK(CM1CON0), 5, a
#define C1ON                             BANKMASK(CM1CON0), 7, a
#define C1OUT                            BANKMASK(CM1CON0), 6, a
#define C1POL                            BANKMASK(CM1CON0), 4, a
#define C1R                              BANKMASK(CM1CON0), 2, a
#define C1RSEL                           BANKMASK(CM2CON1), 5, a
#define C1SP                             BANKMASK(CM1CON0), 3, a
#define C1SYNC                           BANKMASK(CM2CON1), 1, a
#define C1TSEL                           BANKMASK(CCPTMRS), 0, b
#define C2CH0                            BANKMASK(CM2CON0), 0, a
#define C2CH1                            BANKMASK(CM2CON0), 1, a
#define C2HYS                            BANKMASK(CM2CON1), 2, a
#define C2IE                             BANKMASK(PIE2), 5, a
#define C2IF                             BANKMASK(PIR2), 5, a
#define C2IP                             BANKMASK(IPR2), 5, a
#define C2OE                             BANKMASK(CM2CON0), 5, a
#define C2ON                             BANKMASK(CM2CON0), 7, a
#define C2OUT                            BANKMASK(CM2CON0), 6, a
#define C2POL                            BANKMASK(CM2CON0), 4, a
#define C2R                              BANKMASK(CM2CON0), 2, a
#define C2RSEL                           BANKMASK(CM2CON1), 4, a
#define C2SP                             BANKMASK(CM2CON0), 3, a
#define C2SYNC                           BANKMASK(CM2CON1), 0, a
#define C2TSEL                           BANKMASK(CCPTMRS), 3, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP1ASE                          BANKMASK(ECCP1AS), 7, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1MD                           BANKMASK(PMD1), 0, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, a
#define CCP2M1                           BANKMASK(CCP2CON), 1, a
#define CCP2M2                           BANKMASK(CCP2CON), 2, a
#define CCP2M3                           BANKMASK(CCP2CON), 3, a
#define CCP2MD                           BANKMASK(PMD1), 1, a
#define CCP2X                            BANKMASK(CCP2CON), 5, a
#define CCP2Y                            BANKMASK(CCP2CON), 4, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CK1SPP                           BANKMASK(PORTE), 0, a
#define CK2SPP                           BANKMASK(PORTE), 1, a
#define CKE                              BANKMASK(SSP1STAT), 6, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKP                              BANKMASK(SSP1CON1), 4, a
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CM1IE                            BANKMASK(PIE2), 6, a
#define CM1IF                            BANKMASK(PIR2), 6, a
#define CM1IP                            BANKMASK(IPR2), 6, a
#define CM2IE                            BANKMASK(PIE2), 5, a
#define CM2IF                            BANKMASK(PIR2), 5, a
#define CM2IP                            BANKMASK(IPR2), 5, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CMP1MD                           BANKMASK(PMD1), 3, a
#define CMP2MD                           BANKMASK(PMD1), 4, a
#define COUT1                            BANKMASK(CM1CON0), 6, a
#define COUT2                            BANKMASK(CM2CON0), 6, a
#define CRC16EE                          BANKMASK(UEIE), 2, a
#define CRC16EF                          BANKMASK(UEIR), 2, a
#define CRC5EE                           BANKMASK(UEIE), 1, a
#define CRC5EF                           BANKMASK(UEIR), 1, a
#define CREN                             BANKMASK(RCSTA1), 4, a
#define CS                               BANKMASK(PORTE), 2, a
#define CSRC                             BANKMASK(TXSTA1), 7, a
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CTMUEN                           BANKMASK(CTMUCONH), 7, a
#define CTMUIE                           BANKMASK(PIE3), 3, a
#define CTMUIF                           BANKMASK(PIR3), 3, a
#define CTMUIP                           BANKMASK(IPR3), 3, a
#define CTMUMD                           BANKMASK(PMD1), 5, a
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, a
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DACEN                            BANKMASK(VREFCON1), 7, a
#define DACLPS                           BANKMASK(VREFCON1), 6, a
#define DACNSS                           BANKMASK(VREFCON1), 0, a
#define DACOE                            BANKMASK(VREFCON1), 5, a
#define DACPSS0                          BANKMASK(VREFCON1), 2, a
#define DACPSS1                          BANKMASK(VREFCON1), 3, a
#define DACR0                            BANKMASK(VREFCON2), 0, a
#define DACR1                            BANKMASK(VREFCON2), 1, a
#define DACR2                            BANKMASK(VREFCON2), 2, a
#define DACR3                            BANKMASK(VREFCON2), 3, a
#define DACR4                            BANKMASK(VREFCON2), 4, a
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, a
#define DC2B1                            BANKMASK(CCP2CON), 5, a
#define DFN8EE                           BANKMASK(UEIE), 3, a
#define DFN8EF                           BANKMASK(UEIR), 3, a
#define DHEN                             BANKMASK(SSP1CON3), 0, a
#define DIR                              BANKMASK(USTAT), 2, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT                               BANKMASK(PORTC), 7, a
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define D_A                              BANKMASK(SSP1STAT), 5, a
#define D_NOT_A                          BANKMASK(SSP1STAT), 5, a
#define D_nA                             BANKMASK(SSP1STAT), 5, a
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define EDG1POL                          BANKMASK(CTMUCONL), 4, a
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, a
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, a
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, a
#define EDG2POL                          BANKMASK(CTMUCONL), 7, a
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, a
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, a
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, a
#define EDGEN                            BANKMASK(CTMUCONH), 3, a
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EMBMD                            BANKMASK(PMD1), 0, a
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, a
#define EP0HSHK                          BANKMASK(UEP0), 4, a
#define EP0INEN                          BANKMASK(UEP0), 1, a
#define EP0OUTEN                         BANKMASK(UEP0), 2, a
#define EP0STALL                         BANKMASK(UEP0), 0, a
#define EP1CONDIS                        BANKMASK(UEP1), 3, a
#define EP1HSHK                          BANKMASK(UEP1), 4, a
#define EP1INEN                          BANKMASK(UEP1), 1, a
#define EP1OUTEN                         BANKMASK(UEP1), 2, a
#define EP1STALL                         BANKMASK(UEP1), 0, a
#define EP2CONDIS                        BANKMASK(UEP2), 3, a
#define EP2HSHK                          BANKMASK(UEP2), 4, a
#define EP2INEN                          BANKMASK(UEP2), 1, a
#define EP2OUTEN                         BANKMASK(UEP2), 2, a
#define EP2STALL                         BANKMASK(UEP2), 0, a
#define EP3CONDIS                        BANKMASK(UEP3), 3, a
#define EP3HSHK                          BANKMASK(UEP3), 4, a
#define EP3INEN                          BANKMASK(UEP3), 1, a
#define EP3OUTEN                         BANKMASK(UEP3), 2, a
#define EP3STALL                         BANKMASK(UEP3), 0, a
#define EP4CONDIS                        BANKMASK(UEP4), 3, a
#define EP4HSHK                          BANKMASK(UEP4), 4, a
#define EP4INEN                          BANKMASK(UEP4), 1, a
#define EP4OUTEN                         BANKMASK(UEP4), 2, a
#define EP4STALL                         BANKMASK(UEP4), 0, a
#define EP5CONDIS                        BANKMASK(UEP5), 3, a
#define EP5HSHK                          BANKMASK(UEP5), 4, a
#define EP5INEN                          BANKMASK(UEP5), 1, a
#define EP5OUTEN                         BANKMASK(UEP5), 2, a
#define EP5STALL                         BANKMASK(UEP5), 0, a
#define EP6CONDIS                        BANKMASK(UEP6), 3, a
#define EP6HSHK                          BANKMASK(UEP6), 4, a
#define EP6INEN                          BANKMASK(UEP6), 1, a
#define EP6OUTEN                         BANKMASK(UEP6), 2, a
#define EP6STALL                         BANKMASK(UEP6), 0, a
#define EP7CONDIS                        BANKMASK(UEP7), 3, a
#define EP7HSHK                          BANKMASK(UEP7), 4, a
